Conf.Simple/src/Documents/SUI_ДокументОбмена/SUI_ДокументОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SUI_ДокументОбмена</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.SUI_ДополнительныеРеквизитыДокументовОбмена</registerRecords>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОснования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.SUI_ТипыДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецСостояния</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Conf.Simple/src/Enums/SUI_ТипыДокументовОбмена/SUI_ТипыДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыДокументовОбмена</name>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>АдресноеХранениеОтбор</name>
  </enumValues>
  <enumValues>
    <name>АдресноеХранениеРазмещение</name>
  </enumValues>
  <enumValues>
    <name>СборШтрихкодов</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_СостоянияДокументовОбмена/SUI_СостоянияДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияДокументовОбмена</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>КВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Загружен</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Documents/SUI_ДокументОбмена/Forms/ФормаЗагрузкиВДокумента1С/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем РезультатПроверкиДокументаОбмена;

&НаКлиенте
Перем ЗавершитьДокументОбменаПослеЗагрузки;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОбменаСсылка = Параметры.ДокументОбмена;
	НастройкаДокумента = Параметры.НастройкаДокумента;
	
	РежимПросмотра = Параметры.ТолькоПросмотр;
	Элементы.РазрешитьРедактирование.Видимость = Не РежимПросмотра;
	Элементы.Загрузить.Видимость = Не РежимПросмотра;
	Элементы.ГруппаПараметрыЗаписиДокументаОснования.Видимость = Не РежимПросмотра;
	
	Заголовок = ДокументОбменаСсылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьДлительнуюОперацию(НСтр("ru = 'Проверка документа обмена'"));
	ПодключитьОбработчикОжидания("НачатьПроверкуДокумента", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗавершениеРаботы Тогда
		Модифицированность = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Если РежимПросмотра Тогда
			Модифицированность = Ложь;
		Иначе
			
			СтандартнаяОбработка = Ложь;
			Отказ = Истина;
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодтверждениеЗакрытияМодифицированногоПередЗакрытием", ЭтотОбъект);
			ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'При закрытии внесенные изменения не будут сохранены'"), РежимДиалогаВопрос.ОКОтмена);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	РазблокироватьРедактируемыеДанныеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументОбменаТовары

&НаКлиенте
Процедура ДокументОбменаТоварыКоличествоФактПриИзменении(Элемент)
	
	Если Элемент.Родитель.ТекущиеДанные <> Неопределено Тогда
		Элемент.Родитель.ТекущиеДанные.ИндексКартинки = ВычислитьИндексКартинкиСтрокиТабличнойЧасти(
			Элемент.Родитель.ТекущиеДанные.КоличествоПлан, Элемент.Родитель.ТекущиеДанные.КоличествоФакт);
		УстановитьПризнакМодифицированностиСтроки(Элемент.Родитель.ТекущиеДанные, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументОбменаСерии

&НаКлиенте
Процедура ДокументОбменаСерииКоличествоФактПриИзменении(Элемент)
	
	Если Элемент.Родитель.ТекущиеДанные <> Неопределено Тогда
		Элемент.Родитель.ТекущиеДанные.ИндексКартинки = ВычислитьИндексКартинкиСтрокиТабличнойЧасти(
			Элемент.Родитель.ТекущиеДанные.КоличествоПлан, Элемент.Родитель.ТекущиеДанные.КоличествоФакт);
		УстановитьПризнакМодифицированностиСтроки(Элемент.Родитель.ТекущиеДанные, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьДлительнуюОперацию(Команда)
	
	Если ЗначениеЗаполнено(ИдентификаторДлительнойОперации) Тогда
		ОтменитьДлительнуюОперациюНаСервере(ИдентификаторДлительнойОперации);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	ВыполнитьРазрешениеРедактированияРеквизитов(Не Элементы.РазрешитьРедактирование.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ОтобразитьДлительнуюОперацию(НСтр("ru = 'Проверка документа обмена'"));
	ПодключитьОбработчикОжидания("НачатьПроверкуДокумента", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьПослеПодтверждения", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Выполнить загрузку документа обмена в документ 1С?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтобразитьДлительнуюОперацию(Информация = "")
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	
	Если ПустаяСтрока(Информация) Тогда
		Элементы.ДлительнаяОперацияНадписьИнформация.Заголовок = НСтр("ru = 'Выполняется операция'");
	Иначе
		Элементы.ДлительнаяОперацияНадписьИнформация.Заголовок = Информация;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьДлительнуюОперациюНаСервере(Идентификатор)
	ДлительныеОперации.ОтменитьВыполнениеЗадания(Идентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗакрытие(ДополнительныеПараметры) Экспорт
	
	Если SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "СнятьМодифицированность", Ложь, Тип("Булево")) Тогда
		Модифицированность = Ложь;
	КонецЕсли;
	
	Закрыть(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Результат"));
	
	СообщенияПриЗакрытии = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"Сообщения", Новый Массив(), Тип("ФиксированныйМассив"));
	Для индекс = 0 По СообщенияПриЗакрытии.ВГраница() Цикл
		СообщенияПриЗакрытии[индекс].Сообщить();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроверкуДокумента() Экспорт
	
	Модифицированность = Ложь;
	РазблокироватьРедактируемыеДанныеНаСервере();
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОбмена", ДокументОбменаСсылка);
	ПараметрыФормы.Вставить("КнопкаОК", Истина);
	ПараметрыФормы.Вставить("КнопкаОтмена", Истина);
	
	Если ЗначениеЗаполнено(НастройкаДокумента) Тогда
		ПараметрыФормы.Вставить("НастройкаДокумента", НастройкаДокумента);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("НачатьПроверкуДокументаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.SUI_ДокументОбмена.Форма.ФормаПроверкаДокументаОбмена", ПараметрыФормы, ЭтотОбъект,
		УникальныйИдентификатор, Окно, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроверкуДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатПроверкиДокументаОбмена = Результат;
	ОтобразитьДлительнуюОперацию(НСтр("ru = 'Загрузка данных документа обмена в документ основание'"));
	ПодключитьОбработчикОжидания("НачатьЗагрузкуДанныхВДокументОснование", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузкуДанныхВДокументОснование() Экспорт
	
	Если РезультатПроверкиДокументаОбмена <> "Выполнена" И РезультатПроверкиДокументаОбмена <> "ВыполненаСПредупреждениями" Тогда
		ВыполнитьЗакрытие(Новый Структура("СнятьМодифицированность", Истина));
		Возврат;
	КонецЕсли;
	
	ВыполнитьРазрешениеРедактированияРеквизитов(Ложь);
	
	ИдентификаторДлительнойОперации = Неопределено;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НачатьЗагрузкуДанныхВДокументОснованиеЗавершение", ЭтотОбъект);
	
	ДлительнаяОперация = НачатьЗагрузкуДанныхВДокументОснованиеНаСервере();
	
	ИдентификаторДлительнойОперации = ДлительнаяОперация.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗагрузкуДанныхВДокументОснованиеНаСервере()
	
	Если ЭтоАдресВременногоХранилища(ДанныеНастроекТаблицПриЗагрузкеАдрес) Тогда
		УдалитьИзВременногоХранилища(ДанныеНастроекТаблицПриЗагрузкеАдрес);
	КонецЕсли;
	
	ДанныеНастроекТаблицПриЗагрузкеАдрес = "";
	
	Если ЭтоАдресВременногоХранилища(ДокументОснованиеАдрес) Тогда
		УдалитьИзВременногоХранилища(ДокументОснованиеАдрес);
	КонецЕсли;
	
	ДокументОснованиеАдрес = "";
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДокументОбмена", ДокументОбменаСсылка);
	
	Если ЗначениеЗаполнено(НастройкаДокумента) Тогда
		ПараметрыПроцедуры.Вставить("НастройкаДокумента", НастройкаДокумента);
	КонецЕсли;
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.SUI_ДокументОбмена.ЗагрузитьДокументОбменаВДокументОснованиеВФоне", 
		ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура НачатьЗагрузкуДанныхВДокументОснованиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИдентификаторДлительнойОперации = Неопределено;
	
	Если Результат = Неопределено Тогда
		ВыполнитьЗакрытие(Новый Структура("СнятьМодифицированность", Истина));
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницаДокументаОбменаТовары.Видимость = Ложь;
	Элементы.СтраницаДокументаОбменаСерии.Видимость = Ложь;
	Элементы.СтраницаДокументаОбменаШтрихкодыУпаковок.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.Сообщения[индекс]);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		НачатьЗагрузкуДанныхВДокументОснованиеЗавершениеНаСервере(Результат.АдресРезультата);
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДокументОбменаРезультат;
		
	Иначе
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПустая;
		
		Если Результат.Статус = "Ошибка" Тогда
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка.
			|%1'"), Результат.КраткоеПредставлениеОшибки);
		Иначе
			ТекстПредупреждения = НСтр("ru = 'Не удалось получить результат выполнения операции.'");
		КонецЕсли;
		
		ПоказатьПредупреждение(
			Новый ОписаниеОповещения("ВыполнитьЗакрытие", ЭтотОбъект, Новый Структура("СнятьМодифицированность", Истина)), 
			ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьЗагрузкуДанныхВДокументОснованиеЗавершениеНаСервере(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ПроводитьДокументОснованиеПриЗаписи = Результат.ПроводитьДокументОснованиеПриЗаписи;
	ДокументОснованиеСсылка = Результат.ДокументОснованиеСсылка;
	ТипДокумента = Результат.ТипДокумента;
	
	Если Не РежимПросмотра Тогда
		
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Результат.ДокументОбменаСсылка, , УникальныйИдентификатор);
		Исключение
			Модифицированность = Ложь;
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПустая;
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось установить блокировку документа обмена %1
			|%2'"), Результат.ДокументОбменаСсылка, ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Попытка
			ЗаблокироватьДанныеДляРедактирования(ДокументОснованиеСсылка, , УникальныйИдентификатор);
		Исключение
			Модифицированность = Ложь;
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПустая;
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось установить блокировку документа основания %1
			|%2'"), ДокументОснованиеСсылка, ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(СериализаторXDTO.ПрочитатьXDTO(Результат.ДокументОбменаОбъект), "ДокументОбмена");
	ДокументОснованиеАдрес = ПоместитьВоВременноеХранилище(Результат.ДокументОснованиеОбъектXML, УникальныйИдентификатор);
	
	Модифицированность = Результат.МодифицированностьДокументаОбмена;
	
	ДанныеНастроекТаблицПриЗагрузке = Новый Соответствие();
	
	Для Каждого СвязьТаблицы Из Результат.СвязиТаблиц Цикл
		
		ПараметрыЗаполнения = Новый Структура();
		ПараметрыЗаполнения.Вставить("ИмяТабличнойЧасти", СвязьТаблицы.Значение.ИмяТабличнойЧасти);
		ПараметрыЗаполнения.Вставить("ТаблицаСвязей", СвязьТаблицы.Значение.ТаблицаСвязей);
		
		ЗаполнитьДополнительныеДанныеВТаблице(СвязьТаблицы.Ключ, ПараметрыЗаполнения);
		
		ДанныеНастроекТаблицПриЗагрузке.Вставить(СвязьТаблицы.Ключ, СвязьТаблицы.Значение.ДанныеНастройки);
		
	КонецЦикла;
	
	ДанныеНастроекТаблицПриЗагрузкеАдрес = ПоместитьВоВременноеХранилище(ДанныеНастроекТаблицПриЗагрузке, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеДанныеВТаблице(Таблица, ПараметрыЗаполнения)
	
	Если Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
		ТекущаяТабличнаяЧасть = ДокументОбмена.Товары;
		Элементы.СтраницаДокументаОбменаТовары.Видимость = Истина;
		Элементы.ДокументОбменаТоварыЯчейкаЗначение.Видимость = Ложь;
		РеквизитыКЗначению = "Номенклатура,Характеристика,Упаковка,ВидЦены";
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Тогда
		ТекущаяТабличнаяЧасть = ДокументОбмена.Товары;
		Элементы.СтраницаДокументаОбменаТовары.Видимость = Истина;
		Элементы.ДокументОбменаТоварыВидЦеныЗначение.Видимость = Ложь;
		Элементы.ДокументОбменаТоварыЦена.Видимость = Ложь;
		РеквизитыКЗначению = "Номенклатура,Характеристика,Упаковка,Ячейка";
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
		ТекущаяТабличнаяЧасть = ДокументОбмена.Товары;
		Элементы.СтраницаДокументаОбменаТовары.Видимость = Истина;
		Элементы.ДокументОбменаТоварыВидЦеныЗначение.Видимость = Ложь;
		Элементы.ДокументОбменаТоварыЦена.Видимость = Ложь;
		РеквизитыКЗначению = "Номенклатура,Характеристика,Упаковка,Ячейка";
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов Тогда
		ТекущаяТабличнаяЧасть = ДокументОбмена.Товары;
		Элементы.СтраницаДокументаОбменаТовары.Видимость = Истина;
		Элементы.ДокументОбменаТоварыЯчейкаЗначение.Видимость = Ложь;
		Элементы.ДокументОбменаТоварыВидЦеныЗначение.Видимость = Ложь;
		Элементы.ДокументОбменаТоварыЦена.Видимость = Ложь;
		РеквизитыКЗначению = "Номенклатура,Характеристика,Упаковка";
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
		ТекущаяТабличнаяЧасть = ДокументОбмена.Серии;
		Элементы.СтраницаДокументаОбменаСерии.Видимость = Истина;
		РеквизитыКЗначению = "Номенклатура,Характеристика,Серия";
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
		ТекущаяТабличнаяЧасть = ДокументОбмена.ШтрихкодыУпаковок;
		Элементы.СтраницаДокументаОбменаШтрихкодыУпаковок.Видимость = Истина;
		РеквизитыКЗначению = "Номенклатура,Характеристика,Упаковка,ШтрихкодУпаковки";
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТабличнойЧасти Из ТекущаяТабличнаяЧасть Цикл
		
		ЗаполнитьЗначенияВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, РеквизитыКЗначению);
		
		СтрокаТабличнойЧасти.ПриемникТабличнаяЧасть = ПараметрыЗаполнения.ИмяТабличнойЧасти;
		
		Если Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
			Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
			Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
			СтрокаТабличнойЧасти.ИндексКартинки = ВычислитьИндексКартинкиСтрокиТабличнойЧасти(
				СтрокаТабличнойЧасти.КоличествоПлан, СтрокаТабличнойЧасти.КоличествоФакт);
		КонецЕсли;
		
		НайденнаяСвязь = ПараметрыЗаполнения.ТаблицаСвязей.Найти(СтрокаТабличнойЧасти.НомерСтроки, "НомерСтроки");
		
		Если НайденнаяСвязь = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.ПриемникНомерСтроки = НайденнаяСвязь.НомерСтрокиПриемник;
		СтрокаТабличнойЧасти.ПриемникНоваяСтрока = НайденнаяСвязь.НоваяСтрокаПриемник;
		
		Если СтрокаТабличнойЧасти.ПриемникНоваяСтрока Тогда
			СтрокаТабличнойЧасти.ИндексКартинки = ВычислитьИндексКартинкиСтрокиТабличнойЧасти(0,1);
		КонецЕсли;
		
		УстановитьПризнакМодифицированностиСтроки(СтрокаТабличнойЧасти, НайденнаяСвязь.МодифицированностьИсточник, Ложь);
		
		Если НайденнаяСвязь.МодифицированностьИсточник Тогда
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВычислитьИндексКартинкиСтрокиТабличнойЧасти(КоличествоПлан, КоличествоФакт)
	
	Если КоличествоПлан = КоличествоФакт Тогда
		Возврат 0;
	ИначеЕсли КоличествоПлан < КоличествоФакт Тогда
		Возврат 1;
	ИначеЕсли КоличествоПлан > КоличествоФакт Тогда
		Возврат 2;
	Иначе
		Возврат -1;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПризнакМодифицированностиСтроки(СтрокаТабличнойЧасти, Значение, ДляДокументаОснования = Истина)
	
	СтрокаТабличнойЧасти.Модифицированность = Значение;
	
	Если ДляДокументаОснования Тогда
		СтрокаТабличнойЧасти.МодифицированностьДляДокументаОснования = Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЗначенияВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, РеквизитыКОбработке)
	
	Для Каждого ИмяРеквизита Из СтрРазделить(РеквизитыКОбработке, ",", Ложь) Цикл
		
		СтрокаТабличнойЧасти[ИмяРеквизита + "Значение"] = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
			СтрокаТабличнойЧасти[ИмяРеквизита], Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РазблокироватьРедактируемыеДанныеНаСервере()
	
	РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРазрешениеРедактированияРеквизитов(Значение)
	
	Элементы.РазрешитьРедактирование.Пометка = Значение;
	
	Элементы.ДокументОбменаТоварыКоличествоФакт.РедактированиеТекста = Элементы.РазрешитьРедактирование.Пометка;
	Элементы.ДокументОбменаТоварыКоличествоФакт.КнопкаВыбора = Элементы.РазрешитьРедактирование.Пометка;
	
	Элементы.ДокументОбменаСерииКоличествоФакт.РедактированиеТекста = Элементы.РазрешитьРедактирование.Пометка;
	Элементы.ДокументОбменаСерииКоличествоФакт.КнопкаВыбора = Элементы.РазрешитьРедактирование.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеЗакрытияМодифицированногоПередЗакрытием(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		
		ВыполнитьЗакрытие(Новый Структура("СнятьМодифицированность", Истина));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПослеПодтверждения(Подтверждение, ДополнительныеПараметры) Экспорт
	
	Если Подтверждение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимПросмотра Тогда
		ВыполнитьЗакрытие(Новый Структура("СнятьМодифицированность", Истина));
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьПослеПодтвержденияЗавершенияДокументаОбмена", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Завершить документ обмена после загрузки в документ 1С?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПослеПодтвержденияЗавершенияДокументаОбмена(Подтверждение, ДополнительныеПараметры) Экспорт
	
	ЗавершитьДокументОбменаПослеЗагрузки = (Подтверждение = КодВозвратаДиалога.Да);
	
	ОтобразитьДлительнуюОперацию(НСтр("ru = 'Загрузка документа обмена в документ 1С'"));
	ПодключитьОбработчикОжидания("ЗагрузитьПродолжить", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПродолжить() Экспорт
	
	Отказ = Ложь;
	
	Попытка
		Результат = ЗагрузитьНаСервере(Отказ, ЗавершитьДокументОбменаПослеЗагрузки);
	Исключение
		ОтобразитьСтраницуЗавершения(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		
		ОтобразитьСтраницуЗавершения(Ложь);
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	Иначе
		
		ПараметрыЗакрытия = Новый Структура();
		ПараметрыЗакрытия.Вставить("СнятьМодифицированность", Истина);
		ПараметрыЗакрытия.Вставить("Сообщения", Результат.Сообщения);
		
		ПараметрыЗакрытия.Вставить("Результат", Новый Структура());
		ПараметрыЗакрытия.Результат.Вставить("Результат", Истина);
		ПараметрыЗакрытия.Результат.Вставить("ДокументОбмена", ДокументОбмена.Ссылка);
		ПараметрыЗакрытия.Результат.Вставить("НастройкаДокумента", НастройкаДокумента);
		ПараметрыЗакрытия.Результат.Вставить("ДокументОснование", ДокументОснованиеСсылка);
		
		Если Результат.ДокументОбменаОбновлен Тогда
			ОповеститьОбИзменении(ДокументОбмена.Ссылка);
			ПоказатьОповещениеПользователя("Изменение:", 
				ПолучитьНавигационнуюСсылку(ДокументОбмена.Ссылка),
				ДокументОбмена.Ссылка, 
				БиблиотекаКартинок.SUI_ДокументОбменаРедактировать, 
				СтатусОповещенияПользователя.Информация);
		КонецЕсли;
		
		Если Результат.ДокументОснованиеЗагружен Тогда
			ОповеститьОбИзменении(ДокументОснованиеСсылка);
			ПоказатьОповещениеПользователя("Изменение:", 
				ПолучитьНавигационнуюСсылку(ДокументОснованиеСсылка),
				ДокументОснованиеСсылка, 
				БиблиотекаКартинок.SUI_Информация32, 
				СтатусОповещенияПользователя.Информация);
		КонецЕсли;
		
		ВыполнитьЗакрытие(ПараметрыЗакрытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьНаСервере(Отказ, ЗавершитьДокументОбмена)
	
	Результат = Новый Структура();
	Результат.Вставить("ДокументОбменаОбновлен", Ложь);
	Результат.Вставить("ДокументОснованиеЗагружен", Ложь);
	Результат.Вставить("Сообщения", Новый ФиксированныйМассив(Новый Массив()));
	
	НачатьТранзакцию();
	
	Попытка
		
		ДанныеНастроекТаблицПриЗагрузке = Неопределено;
		
		Если ЭтоАдресВременногоХранилища(ДанныеНастроекТаблицПриЗагрузкеАдрес) Тогда
			ДанныеНастроекТаблицПриЗагрузке = ПолучитьИзВременногоХранилища(ДанныеНастроекТаблицПриЗагрузкеАдрес);
		КонецЕсли;
		
		ОписаниеТипаСоответствие = Новый ОписаниеТипов("Соответствие");
		ДанныеНастроекТаблицПриЗагрузке = ОписаниеТипаСоответствие.ПривестиЗначение(ДанныеНастроекТаблицПриЗагрузке);
		
		ОбъектДокументаОснования = ПолучитьОбъектДокументаОснованияПоАдресу(ДокументОснованиеАдрес);
		
		Если ОбъектДокументаОснования = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось получить объект документа основания'"), , , , Отказ);
		Иначе
			
			Если Элементы.СтраницаДокументаОбменаТовары.Видимость Тогда
				
				Если ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.Документ Тогда
					ТипТаблицыКОбновлениюСтрок = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
				ИначеЕсли ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор Тогда
					ТипТаблицыКОбновлениюСтрок = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
				ИначеЕсли ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.АдресноеХранениеРазмещение Тогда
					ТипТаблицыКОбновлениюСтрок = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
				ИначеЕсли ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.СборШтрихкодов Тогда
					ТипТаблицыКОбновлениюСтрок = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов;
				Иначе
					ТипТаблицыКОбновлениюСтрок = Неопределено;
				КонецЕсли;
				
				ОбновитьСтрокиВПриемникеПоМодификации(ТипТаблицыКОбновлениюСтрок, ДокументОбмена.Товары,
					ОбъектДокументаОснования, ДанныеНастроекТаблицПриЗагрузке);
					
			КонецЕсли;
			
			Если Элементы.СтраницаДокументаОбменаСерии.Видимость Тогда
				ОбновитьСтрокиВПриемникеПоМодификации(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии, 
					ДокументОбмена.Серии, ОбъектДокументаОснования, ДанныеНастроекТаблицПриЗагрузке);
			КонецЕсли;
			
			Если Элементы.СтраницаДокументаОбменаШтрихкодыУпаковок.Видимость Тогда
				ОбновитьСтрокиВПриемникеПоМодификации(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок,
					ДокументОбмена.ШтрихкодыУпаковок, ОбъектДокументаОснования, ДанныеНастроекТаблицПриЗагрузке);
			КонецЕсли;
			
			ДополнительныеПараметрыЗаписи = Новый Структура();
			ДополнительныеПараметрыЗаписи.Вставить("ОтключитьРегистрацию");
			ДополнительныеПараметрыЗаписи.Вставить("ОтключитьСобытияSimple");
			
			Если ОтключитьПроверкуЗаполненияДокументаОснования Тогда
				ДополнительныеПараметрыЗаписи.Вставить("ОтключитьПроверкуЗаполнения");
			КонецЕсли;
			
			Если Не РежимЗагрузкиДокументаОснования Тогда
				ДополнительныеПараметрыЗаписи.Вставить("ОтключитьРежимЗагрузки");
			КонецЕсли;
			
			ДополнительныеПараметрыЗаписи.Вставить("ПроводитьДокумент", ПроводитьДокументОснованиеПриЗаписи);
			
			РезультатЗаписи = Документы.SUI_ДокументОбмена.ЗаписатьДокументОснование(ОбъектДокументаОснования,
				НастройкаДокумента, ДополнительныеПараметрыЗаписи);
			
			Если РезультатЗаписи.ДокументЗаписан Тогда
				Результат.ДокументОснованиеЗагружен = Истина;
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = '%1 загружен в документ %2'"),
					ДокументОбмена.Ссылка, ДокументОснованиеСсылка));
			Иначе
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не Отказ И 
			(Модифицированность Или 
			(ЗавершитьДокументОбмена И ДокументОбмена.Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.Завершен)) Тогда
			
			Если ПроверитьЗаполнение() Тогда
				
				Если ЗавершитьДокументОбмена Тогда
					Документы.SUI_ДокументОбмена.СменитьСостояниеДокументаОбмена(ДокументОбмена, 
						Перечисления.SUI_СостоянияДокументовОбмена.Завершен);
				КонецЕсли;
				
				Записать();
				
				Модифицированность = Ложь;
				
				Результат.ДокументОбменаОбновлен = Истина;
				
			Иначе
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Результат.Сообщения = ПолучитьСообщенияПользователю(Истина);
		
		Если Отказ Тогда
			ОтменитьТранзакцию();
		Иначе
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ДокументыОбменаКлиентСервер.ИмяСобытия(НСтр("ru = 'Запись'")), ,
			Метаданные.Документы.SUI_ДокументОбмена, ДокументОбмена.Ссылка, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОбъектДокументаОснованияПоАдресу(Адрес)
	
	ОбъектДокументаОснования = Неопределено;
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		
		ЗначениеИзХранилища = ПолучитьИзВременногоХранилища(Адрес);
		
		Если ТипЗнч(ЗначениеИзХранилища) = Тип("Строка") Тогда
			
			ЗначениеИзХранилища = ОбщегоНазначения.ЗначениеИзСтрокиXML(ЗначениеИзХранилища);
			
			ТипXML = XMLТип(ТипЗнч(ЗначениеИзХранилища));
			
			Если ТипXML <> Неопределено Тогда
				
				XMLИмяТипа = ТипXML.ИмяТипа;
				Если СтрНачинаетсяС(XMLИмяТипа, "DocumentObject.") Тогда
					ОбъектДокументаОснования = ЗначениеИзХранилища;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбъектДокументаОснования;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтрокиВПриемникеПоМодификации(ТипТаблицы, ТабличнаяЧасть, ОбъектДокументОснования, ДанныеНастроекТаблицПриЗагрузке)
		
	НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Новый Структура("МодифицированностьДляДокументаОснования", Истина));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНастройкиПриЗагрузке = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(ДанныеНастроекТаблицПриЗагрузке, 
		ТипТаблицы, Новый Структура(), Тип("Структура"));
	
	АлгоритмОбработкиСтрок = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеНастройкиПриЗагрузке, 
		"АлгоритмОбработкиСтрок", "", Тип("Строка"));
	ИмяРеквизитаКоличествоФакт = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеНастройкиПриЗагрузке, 
		"ИмяРеквизитаКоличествоФакт", "", Тип("Строка"));
	
	Если ПустаяСтрока(АлгоритмОбработкиСтрок) И ПустаяСтрока(ИмяРеквизитаКоличествоФакт) Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеСтрок = Новый Соответствие();
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		СоответствиеСтрок.Вставить(НайденнаяСтрока.НомерСтроки,
			ОбъектДокументОснования[НайденнаяСтрока.ПриемникТабличнаяЧасть].Найти(НайденнаяСтрока.ПриемникНомерСтроки, "НомерСтроки"));
	КонецЦикла;
	
	Если ПустаяСтрока(АлгоритмОбработкиСтрок) Тогда
		
		Для индекс = 0 По НайденныеСтроки.ВГраница() Цикл
			
			СтрокаПриемник = СоответствиеСтрок.Получить(НайденныеСтроки[индекс].НомерСтроки);
			
			Если СтрокаПриемник = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаПриемник[ИмяРеквизитаКоличествоФакт] = НайденныеСтроки[индекс].КоличествоФакт;
			
		КонецЦикла;
		
	Иначе
		
		СоответствиеРеквизитов = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеНастройкиПриЗагрузке, "СоответствиеРеквизитов");
		РеквизитыИдентификации = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеНастройкиПриЗагрузке, "РеквизитыИдентификации");
		
		ИменаКолонок = ПолучитьИменаКолонокТабличнойЧасти(ТабличнаяЧасть, "ПриемникНоваяСтрока,ПриемникТабличнаяЧасть,
		|ИндексКартинки,ИсходныйНомерСтроки,МодифицированностьДляДокументаОснования");
		
		Для индекс = 0 По НайденныеСтроки.ВГраница() Цикл
			
			СтрокаПриемник = СоответствиеСтрок.Получить(НайденныеСтроки[индекс].НомерСтроки);
			
			Если СтрокаПриемник = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыОбработки = Новый Структура();
			ПараметрыОбработки.Вставить("ДокументОбменаСсылка", ДокументОбмена.Ссылка);
			ПараметрыОбработки.Вставить("ДокументОснованиеОбъект", ОбъектДокументОснования);
			ПараметрыОбработки.Вставить("Алгоритм", АлгоритмОбработкиСтрок);
			ПараметрыОбработки.Вставить("СоответствиеРеквизитов", СоответствиеРеквизитов);
			ПараметрыОбработки.Вставить("РеквизитыИдентификации", РеквизитыИдентификации);
			ПараметрыОбработки.Вставить("ЭтоНоваяСтрока", Ложь);
			ПараметрыОбработки.Вставить("СтрокаИсточник", НайденныеСтроки[индекс]);
			ПараметрыОбработки.Вставить("СтрокаПриемник", СтрокаПриемник);
			ПараметрыОбработки.Вставить("ТабличнаяЧастьПриемник", ОбъектДокументОснования[НайденныеСтроки[индекс].ПриемникТабличнаяЧасть]);
			ПараметрыОбработки.Вставить("ДанныеЗаполнения", ПолучитьДанныеЗаполненияИзСтрокиТабличнойЧасти(НайденныеСтроки[индекс], ИменаКолонок));
			
			РезультатОбработки = Документы.SUI_ДокументОбмена.ОбработатьСтрокуТабличнойЧастиЧерезАлгоритм(ПараметрыОбработки);
			
			Если РезультатОбработки.СтрокаИсточникМодифицированна Тогда
				Модифицированность = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИменаКолонокТабличнойЧасти(ТабличнаяЧасть, Знач ИсключитьКолонки = "")
	
	ИменаКолонок = Новый Массив();
	
	ИсключитьКолонки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьКолонки, ",", Истина, Истина);
	
	Для Каждого Колонка Из ТабличнаяЧасть.Выгрузить(Новый Структура("НомерСтроки", -1)).Колонки Цикл
		
		Если ИсключитьКолонки.Найти(Колонка.Имя) = Неопределено Тогда
			ИменаКолонок.Добавить(Колонка.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(ИменаКолонок, ",");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаполненияИзСтрокиТабличнойЧасти(СтрокаТабличнойЧасти, ИменаКолонок)
	
	ДанныеЗаполнения = Новый Структура();
	
	Источник = Новый Структура(ИменаКолонок);
	ЗаполнитьЗначенияСвойств(Источник, СтрокаТабличнойЧасти);
	
	ОтложенныеКлючиЗначений = Новый Структура();
	
	Для Каждого ЭлементИсточника Из Источник Цикл
		
		Ключ = ЭлементИсточника.Ключ;
		
		Если Ключ = "ПриемникНомерСтроки" Тогда
			Ключ = "НомерСтрокиПриемник";
		ИначеЕсли СтрДлина(Ключ) > 8 И СтрЗаканчиваетсяНа(Ключ, "Значение") И Источник.Свойство(Лев(Ключ, СтрДлина(Ключ) - 8)) Тогда
			ОтложенныеКлючиЗначений.Вставить(Ключ, Лев(Ключ, СтрДлина(Ключ) - 8));
			Продолжить;
		КонецЕсли;
		
		ДанныеЗаполнения.Вставить(Ключ, ЭлементИсточника.Значение);
		
	КонецЦикла;
	
	Для Каждого ОтложенныйКлючЗначений Из ОтложенныеКлючиЗначений Цикл
		ДанныеЗаполнения.Вставить(ОтложенныйКлючЗначений.Значение, Источник[ОтложенныйКлючЗначений.Ключ]);
	КонецЦикла;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьСтраницуЗавершения(РезультатЗавершения)
	
	Если РезультатЗавершения Тогда
		Элементы.КартинкаЗавершения.Картинка = БиблиотекаКартинок.SUI_Проверено;
		Элементы.КартинкаЗавершения.Подсказка = СтрШаблон(НСтр("ru = 'Загрузка в документ %1 выполнена'"), ДокументОснованиеСсылка);
	Иначе
		Элементы.КартинкаЗавершения.Картинка = БиблиотекаКартинок.SUI_ПредупреждениеЖелтый;
		Элементы.КартинкаЗавершения.Подсказка = СтрШаблон(НСтр("ru = 'Загрузка в документ %1 не выполнена'"), ДокументОснованиеСсылка);
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗавершение;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти
